Revit 2024 API
ExportPatternKey Members
The ExportPatternKey type exposes the following members.
Constructors
Name | Description
ExportPatternKey()
 Constructs a new default ExportPatternKey.
ExportPatternKey(ExportPatternKey)
 Constructs a new copy of the input ExportPatternKey object.
ExportPatternKey(FillPatternTarget, String)
 Constructs a new ExportPatternKey using the original fill pattern type and name as input.
Methods
Name | Description
Dispose
Releases all resources used by the ExportPatternKey
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
OriginalFillPatternName
 The original FillPattern name.
OriginalFillPatternType
 The original FillPattern type.
See Also
ExportPatternKey Class
Autodesk.Revit.DB Namespace